<a href="https://colab.research.google.com/github/bellatchen/Assignments/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Bella Chen

In [1]:
import pandas as pd

In [50]:
#uploading Data set
Titanic = "/content/drive/MyDrive/Coding Dojo/Data Sets/titanic.csv"
Titanic_df = pd.read_csv(Titanic)
Titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [59]:
Titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [51]:
#filters
female_filter = Titanic_df["Sex"]=="female"
male_filter = Titanic_df["Sex"]=="male"
survived_filter = Titanic_df["Survived"]==1
did_not_survive_filter = Titanic_df["Survived"]==0
Fare_Filter = Titanic_df["Fare"] < 10

In [52]:
#1 display head of dataframe
Titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
#2 percentage of people who survived (find mean of survival column)
Titanic_df["Survived"].mean()

0.3838383838383838

In [54]:
#3.1 how many of each sex survived - Female Survivors
Female_Survivors = Titanic_df.loc[female_filter & survived_filter, :]
Female_Survivors['Survived'].sum()

233

In [55]:
#3.2 how many of each sex survived - Male Survivors
Male_Survivors = Titanic_df.loc[male_filter & survived_filter, :]
Male_Survivors['Survived'].sum()

109

In [73]:
#4 what percentage of those who paid less than $10 survived?
Titanic_df[Fare_Filter]["Survived"].mean()

0.19940476190476192

In [57]:
#5 overall average age of those who didn't survive?
Avg_age_nonsurvivors = Titanic_df[did_not_survive_filter]["Age"].mean()
Avg_age_nonsurvivors

30.62617924528302

In [58]:
#6 overall average age of survivors
Avg_age_survivors = Titanic_df[survived_filter]["Age"].mean()
Avg_age_survivors

28.343689655172415

In [66]:
#7 average age of those who did and didn't survive grouped by sex
Titanic_df.groupby(["Sex","Survived"])["Age"].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64